[
{
  "model": "articles.article",
  "pk": 1,
  "fields": {
    "title": "How to negotiate for a better salary",
    "owner": 5,
    "date": "2019-08-04T12:00:00Z",
    "text": "You might be a great developer with a diverse skill set but if you don’t have the soft skills that are required, you may not be going to the place you’ve been dreaming of. Negotiation is one of those skills that are important for any job. Whether you’re negotiating for an offer in an interview or negotiating for a raise with your company, there are some simple things that you should follow to yield better results. Recently I was discussing in a twitter thread that is discussing salary discussion and how to negotiate better. I attended almost 30 interviews before joining on my current job and turned down most of the offers I got in the salary negotiation round. I can say that I learned a thing or two in those situations and that twitter thread gave me enough motivation to write this down. Note 1: This is written mostly based on the Indian job market and I am not aware of any other country’s job market, but most of these points can be applied to any job anywhere. Note 2: This is written with experienced developers in mind. If you’re on the first 3 years of your carrier you might be still learning a lot, you’re welcome to read this post but I am not recommending this advice for you.  Veni KuncheVeni Kunche @venikunche I am too embarrassed to share my salary. Let's just say underfunded government agencies don't pay much. And don't take Midwest pay while living on the east coast. :woman-facepalming::skin-tone-5: Also, I wish someone told me this when I started working. Always negotiate. Never reveal your previous salary. TwitterTwitter | 15 Feb 13:12 1) Know your value (Market research) First and foremost thing is to know how much you’re worth as a developer. You should be aware of the average market rates for your skillset and experience. Companies will mostly try to stick within the market average unless they’re in need of an urgent resource. But in most organizations this information is confidential and one should not reveal how much they’re getting paid to their peers. This is partly for good reasons and partly used by some companies to take advantage of people. So the only way to get this information is to get it from the community of developers around you. Go to your local meetup group, WhatsApp/telegram groups for developers and try to talk to them about it. To yield better results, share an anonymous form with the group and you’ll have a better chance of getting that information. There are online sources of information such as Payscale which provides this information along with further advice on your career path, but I am skeptical about the accuracy of the information. Recently there was also a twitter trend #KnowYourWorth in which a lot of people posted how much they make and someone did a stellar job of making a beautiful website with that information grouped by countries. Chances are twitter might be more accurate than payscale’s data because it is very recent. I suggest you use two or three methods of finding th",
    "categories": [
      6
    ]
  }
}
]
